frontend/controllers/UserController.php

SELECT * FROM `usertable` WHERE `Username`='Amy'
---
    protected function findUserGeneralInfo($Username)
    {
        if (($model = Usertable::findOne($Username)) !== null) {

SELECT * FROM `userbillingaddress` WHERE `Username`='Amy'
---
    protected function findUserBillingAddressInfo($Username)
    {
        if (($model = Userbillingaddress::find()->where(['Username' => $Username ])->one() ) !== null) {