frontend/models/User/UserBillingAddressSearch.php

SELECT * FROM `userbillingaddress` WHERE `Username`='Amy'
---
    public function SearchBillingAddress($user)
    {
        $query = Userbillingaddress::find()->where(['Username' => $user ])->one();