frontend/models/User/UserInfoSearch.php

    public function search($user)
    {
        $query = Usertable::find()->where(['Username' => $user ])->one();
---
SELECT * FROM `usertable` WHERE `Username`='Amy'