frontend/models/User/UserShippingAddressForm.php

    public function SaveShippingAddress()
    {
        if (!$this->validate()) {
            return null;
        }

        $ShippingAdressInfo = new Usershippingaddress();
        $ShippingAdressInfo->Username = $this->Username;
        $ShippingAdressInfo->StreetName = $this->StreetName;
        $ShippingAdressInfo->CityName = $this->CityName;
        $ShippingAdressInfo->StateName = $this->StateName;
        $ShippingAdressInfo->Zipcode = $this->Zipcode;


        return $ShippingAdressInfo->save() ? $ShippingAdressInfo : null;
---
INSERT INTO `usershippingaddress` (`Username`, `StreetName`, `CityName`, `StateName`, `Zipcode`) VALUES ('Amy', 'Calle Torotola', 'Sabana Hoyos', 'Arecibo', '00587')