frontend/models/User/UserBillingAddressForm.php

INSERT INTO `userbillingaddress` (`Username`, `StreetName`, `CityName`, `StateName`, `Zipcode`) VALUES ('Amy', 'Calle Torotola', 'Sabana Hoyos', 'Arecibo', '00587')
---
    public function SaveBillingAddress()
    {
        if (!$this->validate()) {
            return null;
        }

        $BillingAdressInfo = new Userbillingaddress();
        $BillingAdressInfo->Username = $this->Username;
        $BillingAdressInfo->StreetName = $this->StreetName;
        $BillingAdressInfo->CityName = $this->CityName;
        $BillingAdressInfo->StateName = $this->StateName;
        $BillingAdressInfo->Zipcode = $this->Zipcode;


        return $BillingAdressInfo->save() ? $BillingAdressInfo : null;