frontend/models/User/UserShippingAddressSearch.php

SELECT * FROM `usershippingaddress` WHERE `Username`='Amy'
---
    public function SearchShippingAddress($user)
    {
        $query = Usershippingaddress::find()->where(['Username' => $user ])->one();