backend/models/NewProductForm.php

INSERT INTO `product` (`ProductID`, `Title`, `Description`, `Dimensions`, `Image`, `Category`, `Price`, `Stock`) VALUES ('896-189-60', 'The Rooster', 'sjadgugugau autgudauduawdg adua dad dtya dyauy duawud ', '1000 x 1000', 'C:\\xampp\\htdocs\\PhpSites\\Boceto_Boricua_V3\\common/Images/ink/The Rooster.jpg', 'ink', 30, 2)
---
    public function storeProductData()
    {
        if (!$this->validate()) {
            return null;
        }

        $newProduct = new Product();

        $newProduct->ProductID = $this->ProductID;
        $newProduct->Title = $this->Title;
        $newProduct->Description = $this->Description;
        $newProduct->Dimensions = $this->Dimensions;
        $newProduct->Image = $this->Image;
        $newProduct->Category = $this->Category;
        $newProduct->Price = $this->Price;
        $newProduct->Stock = $this->Stock;


        return $newProduct->save() ? $newProduct : null;